In [8]:
import pandas as pd 
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt
from scipy.stats import zscore

In [9]:
faccount_df = pd.read_csv("./dataset/faccount.txt")
ftxn2_df = pd.read_csv("./dataset/ftxn2.txt")

In [10]:
ftxn2_df.head()

,TXN_ID,TXTYPE,AMOUNT,FROMACCTID,TOACCTID,TXDATE,REFERENCE,ISFRAUD,ISFLAGGED
0,950060711303,PAYMENT,320,500607,800242,2020-01-22T17:00:00,Dinner with Shane,N,Y
1,950060711401,PAYMENT,48,500607,800111,2020-01-23T08:00:00,Breakfast with Steven,N,Y
2,950060711402,TRANSFER,6209,500607,500929,2020-01-23T13:00:00,Holiday Cost,N,Y
3,950060711403,PAYMENT,66,500607,800252,2020-01-23T17:00:00,Meal with Mary,N,Y
4,950060711501,PAYMENT,47,500607,800116,2020-01-24T08:00:00,Coffee with Brian,N,Y

In [12]:
print(faccount_df.columns)
print(ftxn2_df.columns)

Index(['ACCTID', 'ACCTTYPE', 'ACCTNAME', 'FIRSTNAME', 'SURNAME', 'DOB',
       'ACCTCREATED', 'ACCTRISK', 'ADDRESS', 'ADDRESS_LAT', 'ADDRESS_LON',
       'CATEGORY'],
      dtype='object')
Index(['TXN_ID', 'TXTYPE', 'AMOUNT', 'FROMACCTID', 'TOACCTID', 'TXDATE',
       'REFERENCE', 'ISFRAUD', 'ISFLAGGED'],
      dtype='object')

In [29]:
#account types
print(faccount_df["ACCTTYPE"].unique())

#account categories
print(faccount_df["CATEGORY"].unique())

['BUSINESS' 'CREDIT' 'MAXI-SAVER' 'SAVINGS']
['Supermarket' 'Grocery' 'Cafe' 'Bakery' 'Hotel' 'Restaurant' 'Builders'
 'Lawyers' 'Crash Repairs' 'Apparel' 'Smallgoods' 'Property' 'Cleaning'
 'Gardening' 'Electrical' 'Wholesale' 'Events' 'Computers' 'Clinic'
 'Winery' 'Roasters' 'Pottery' 'Therapeutics' 'Fitness' 'Physiotherapy'
 'Beauty' 'Podiatry' 'Florist' 'Finance' 'Sports' 'Brewery' 'Used Cars'
 'Garage' 'Pharmacy' 'Butcher' 'Consulting' 'Distillery' 'Cheeses'
 'Management' 'Services' 'Childcare' 'Digital' 'Accounting' 'Salamis'
 'Trading' 'Music' 'CUSTOMER']

In [52]:
faccount_df['FULLNAME'] = faccount_df['FIRSTNAME']+" "+faccount_df['SURNAME']

#count the number of time a person created an account
faccount_df['same_person_count'] = faccount_df.groupby('FULLNAME')['FULLNAME'].transform('count')

,ACCTID,ACCTTYPE,ACCTNAME,FIRSTNAME,SURNAME,DOB,ACCTCREATED,ACCTRISK,ADDRESS,ADDRESS_LAT,ADDRESS_LON,CATEGORY,FULLNAME,same_person_count
21,800060,CREDIT,Johnson Supermarket,Shannon,Johnson,1990-11-30T00:00:00,2018-11-18T00:00:00,LOW,BRISBANE,-27.538038,152.959944,Supermarket,Shannon Johnson,2
1718,500956,CREDIT,"Johnson, Shannon",Shannon,Johnson,1985-09-13T00:00:00,2015-08-25T00:00:00,LOW,BRISBANE,-27.441138,153.020408,CUSTOMER,Shannon Johnson,2

In [33]:
def id_to_name(id,id_name_dict):
    return id_name_dict["FULLNAME"][int(id)]


id_and_names = faccount_df[["ACCTID","FULLNAME"]].set_index("ACCTID").to_dict()


ftxn2_df["FROMNAME"] = np.vectorize(id_to_name)(ftxn2_df["FROMACCTID"], id_and_names)
ftxn2_df["TONAME"] = np.vectorize(id_to_name)(ftxn2_df["TOACCTID"], id_and_names)


ftxn2_df.head()

,TXN_ID,TXTYPE,AMOUNT,FROMACCTID,TOACCTID,TXDATE,REFERENCE,ISFRAUD,ISFLAGGED,FROMNAME,TONAME
0,950060711303,PAYMENT,320,500607,800242,2020-01-22T17:00:00,Dinner with Shane,N,Y,Elizabeth Smith,Taylor Marshall
1,950060711401,PAYMENT,48,500607,800111,2020-01-23T08:00:00,Breakfast with Steven,N,Y,Elizabeth Smith,Johnny Johnson
2,950060711402,TRANSFER,6209,500607,500929,2020-01-23T13:00:00,Holiday Cost,N,Y,Elizabeth Smith,Amanda Harper
3,950060711403,PAYMENT,66,500607,800252,2020-01-23T17:00:00,Meal with Mary,N,Y,Elizabeth Smith,Anthony Austin
4,950060711501,PAYMENT,47,500607,800116,2020-01-24T08:00:00,Coffee with Brian,N,Y,Elizabeth Smith,William Baker